; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v2 ?v6)
             (pred_10 ?v4 ?v12)
             (pred_12 ?v2 ?v12)
             (pred_9 ?v13 ?v2 )
	     (pred_2 ?v2)
             (pred_5 ?v5)
             (pred_1 ?v4)
             (pred_11 ?v12)
             (pred_8 ?v2)
             (pred_4 ?v4)
             (pred_3 ?v2)
             (pred_6 ))



(:action op_1
:parameters (?v11 ?v9 ?v1 ?v8)
:precondition (and (pred_5 ?v11) (pred_5 ?v9) (pred_1 ?v1) (pred_11 ?v8)
          (pred_7 ?v11 ?v9) (pred_10 ?v1 ?v8)
                   (pred_12 ?v9 ?v8) (pred_2 ?v11) 
                   (pred_8 ?v9) (pred_4 ?v1))
:effect (and  (pred_3 ?v9) (not (pred_8 ?v9))))


(:action op_4
:parameters (?v11 ?v10)
:precondition (and (pred_5 ?v11) (pred_5 ?v10)
               (pred_2 ?v11) (pred_7 ?v11 ?v10) (pred_3 ?v10))
:effect (and (pred_2 ?v10) (not (pred_2 ?v11))))

(:action op_2
:parameters (?v11 ?v1)
:precondition (and (pred_5 ?v11) (pred_1 ?v1) 
                  (pred_2 ?v11) (pred_9 ?v1 ?v11) (pred_6 ))
:effect (and (pred_4 ?v1)
   (not (pred_9 ?v1 ?v11)) (not (pred_6 ))))


(:action op_3
:parameters (?v11 ?v3 ?v7)
:precondition (and (pred_5 ?v11) (pred_1 ?v3) (pred_1 ?v7)
                  (pred_2 ?v11) (pred_4 ?v7) (pred_9 ?v3 ?v11))
:effect (and (pred_4 ?v3) (pred_9 ?v7 ?v11)
        (not (pred_4 ?v7)) (not (pred_9 ?v3 ?v11))))

(:action op_5
:parameters (?v11 ?v1)
:precondition (and (pred_5 ?v11) (pred_1 ?v1) 
                  (pred_2 ?v11) (pred_4 ?v1))
:effect (and (pred_6 ) (pred_9 ?v1 ?v11) (not (pred_4 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_14 obj_21 obj_19 obj_12 obj_10 obj_08 obj_02 obj_04 obj_07 obj_15 obj_22 obj_03 obj_16 obj_20 obj_01
    obj_05 obj_17 obj_09
    obj_13 obj_11 obj_18
    )

    (:init
       (pred_6)

       (pred_5 obj_06)
       (pred_5 obj_14)
       (pred_5 obj_21)
       (pred_5 obj_19)
       (pred_5 obj_12)
       (pred_5 obj_10)
       (pred_5 obj_08)
       (pred_5 obj_02)
       (pred_5 obj_04)
       (pred_5 obj_07)
       (pred_5 obj_15)
       (pred_5 obj_22)
       (pred_5 obj_03)
       (pred_5 obj_16)
       (pred_5 obj_20)
       (pred_5 obj_01)
       (pred_11 obj_05)
       (pred_11 obj_17)
       (pred_11 obj_09)
       (pred_1 obj_13)
       (pred_1 obj_11)
       (pred_1 obj_18)

       (pred_7 obj_06 obj_12)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_14 obj_10)
       (pred_7 obj_14 obj_21)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_21 obj_08)
       (pred_7 obj_21 obj_19)
       (pred_7 obj_21 obj_14)
       (pred_7 obj_19 obj_02)
       (pred_7 obj_19 obj_21)
       (pred_7 obj_12 obj_04)
       (pred_7 obj_12 obj_10)
       (pred_7 obj_12 obj_06)
       (pred_7 obj_10 obj_07)
       (pred_7 obj_10 obj_08)
       (pred_7 obj_10 obj_14)
       (pred_7 obj_10 obj_12)
       (pred_7 obj_08 obj_15)
       (pred_7 obj_08 obj_02)
       (pred_7 obj_08 obj_21)
       (pred_7 obj_08 obj_10)
       (pred_7 obj_02 obj_22)
       (pred_7 obj_02 obj_19)
       (pred_7 obj_02 obj_08)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_04 obj_07)
       (pred_7 obj_04 obj_12)
       (pred_7 obj_07 obj_16)
       (pred_7 obj_07 obj_15)
       (pred_7 obj_07 obj_10)
       (pred_7 obj_07 obj_04)
       (pred_7 obj_15 obj_20)
       (pred_7 obj_15 obj_22)
       (pred_7 obj_15 obj_08)
       (pred_7 obj_15 obj_07)
       (pred_7 obj_22 obj_01)
       (pred_7 obj_22 obj_02)
       (pred_7 obj_22 obj_15)
       (pred_7 obj_03 obj_16)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_16 obj_20)
       (pred_7 obj_16 obj_07)
       (pred_7 obj_16 obj_03)
       (pred_7 obj_20 obj_01)
       (pred_7 obj_20 obj_15)
       (pred_7 obj_20 obj_16)
       (pred_7 obj_01 obj_22)
       (pred_7 obj_01 obj_20)
       (pred_8 obj_01)
       (pred_8 obj_07)
       (pred_8 obj_15)
       (pred_12  obj_01 obj_05)
       (pred_12  obj_07 obj_17)
       (pred_12  obj_15 obj_09)
       (pred_3 obj_06)
       (pred_3 obj_14)
       (pred_3 obj_21)
       (pred_3 obj_19)
       (pred_3 obj_12)
       (pred_3 obj_10)
       (pred_3 obj_08)
       (pred_3 obj_02)
       (pred_3 obj_04)
       (pred_3 obj_22)
       (pred_3 obj_03)
       (pred_3 obj_16)
       (pred_3 obj_20)

       (pred_10  obj_13 obj_05)
       (pred_10  obj_11 obj_17)
       (pred_10  obj_18 obj_09)
       (pred_9 obj_13 obj_02)
       (pred_9 obj_11 obj_10)
       (pred_9 obj_18 obj_16)
       (pred_2 obj_22)
    )

    (:goal (and
       (pred_9 obj_13 obj_04)
    ))
(:constraints
  (always (not (pred_2 obj_08)))
)
)

; plan
1. (op_4 obj_22 obj_02)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_02)
   goals met: 0 of 1
2. (op_2 obj_02 obj_13)
   deleted: (pred_9 obj_13 obj_02) (pred_6)
   added: (pred_4 obj_13)
   goals met: 0 of 1
3. (op_4 obj_02 obj_19)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_19)
   goals met: 0 of 1
4. (op_4 obj_19 obj_21)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_21)
   goals met: 0 of 1
5. (op_4 obj_21 obj_14)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_14)
   goals met: 0 of 1
6. (op_4 obj_14 obj_06)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_06)
   goals met: 0 of 1
7. (op_4 obj_06 obj_12)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_12)
   goals met: 0 of 1
8. (op_4 obj_12 obj_04)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_04)
   goals met: 0 of 1
9. (op_5 obj_04 obj_13)
   deleted: (pred_4 obj_13)
   added: (pred_6) (pred_9 obj_13 obj_04)
   goals met: 1 of 1
